<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <div id="menu-placeholder"></div>
			<script>
			  fetch('menu.html')
				.then(response => response.text())
				.then(data => {
				  document.getElementById('menu-placeholder').innerHTML = data;
				})
				.catch(error => console.error('Erro ao carregar o menu:', error));
			</script>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Algoritmos e Estrutura da Informa&ccedil;&atilde;o</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Material Auxiliar</h2>

				<p><a href="Anexos/AlgoritmosEEstruturaDaInformacao.pdf">Apostila de algoritmos e estrutura da informa&ccedil;&atilde;o</a></p>

				<p><a href="Anexos/Referência-Programação-C.pdf">Refer&ecirc;ncia Programa&ccedil;&atilde;o em C</a></p>

				<p><a href="Anexos/Lista-de-exercicios-1.pdf">Lista de exerc&iacute;cios 1</a></p>

				<p><a href="Anexos/Lista-de-exercicios-2.pdf">Lista de exercicios 2</a></p>

				<p><a href="Anexos/Lista-de-exercicios-3.pdf">Lista de exercicios 3</a></p>

				<h2>Ementa</h2>

				<p>Abstra&ccedil;&atilde;o procedural: t&eacute;cnicas de modulariza&ccedil;&atilde;o, fun&ccedil;&otilde;es, passagem de par&acirc;metros por valor e refer&ecirc;ncia. Ponteiros: defini&ccedil;&otilde;es, uso com vetores, matrizes e registros. Recursividade e iteratividade, ordem de crescimento e barreiras de abstra&ccedil;&atilde;o. Abstra&ccedil;&atilde;o de dados: listas, &aacute;rvores bin&aacute;rias, filas, tabelas. Algoritmos de ordena&ccedil;&atilde;o: BubleSort, InsertSort e QuickSort.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Apresentar as principais estruturas de dados e os principais algoritmos utilizados no desenvolvimento modular de programas de computador permitindo assim aos alunos desenvolver suas pr&oacute;prias aplica&ccedil;&otilde;es na &aacute;rea de controle e automa&ccedil;&atilde;o.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Apresentar as t&eacute;cnicas de abstra&ccedil;&atilde;o procedimental atrav&eacute;s da modulariza&ccedil;&atilde;o e outras metodologias relacionadas.</li>
					<li>Estudar o sistema de ponteiros, suas defini&ccedil;&otilde;es e utiliza&ccedil;&otilde;es.</li>
					<li>Estudar a recursividade, iteratividade e outras t&eacute;cnicas relacionadas.</li>
					<li>Conhecer as principais estruturas de abstra&ccedil;&atilde;o de dados.</li>
					<li>Compreender o funcionamento dos principais algoritmos de ordena&ccedil;&atilde;o de dados.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do Plano de Ensino, Introdu&ccedil;&atilde;o a disciplina &ndash; 4 Aulas</li>
					<li>Revis&atilde;o programa&ccedil;&atilde;o em linguagem C &ndash; 4 Aulas</li>
					<li>Lista de exerc&iacute;cios 1 &ndash; 4 Aulas</li>
					<li>Ponteiros: defini&ccedil;&otilde;es, uso com vetores, matrizes e registros &ndash; 4 Aulas</li>
					<li>Abstra&ccedil;&atilde;o procedural: t&eacute;cnicas de modulariza&ccedil;&atilde;o, fun&ccedil;&otilde;es &ndash; 4 Aulas</li>
					<li>Abstra&ccedil;&atilde;o procedural: passagem de par&acirc;metros por valor e refer&ecirc;ncia &ndash; 4 Aulas</li>
					<li>Avali&ccedil;&atilde;o 1 &ndash; 4 Aulas</li>
					<li>Recursividade e iteratividade &ndash; 4 Aulas</li>
					<li>Ordem de crescimento e barreiras de abstra&ccedil;&atilde;o &ndash; 4 Aulas</li>
					<li>Lista de exerc&iacute;cios 2 &ndash; 4 Aulas</li>
					<li>Avali&ccedil;&atilde;o 2 &ndash; 4 Aulas</li>
					<li>Abstra&ccedil;&atilde;o de dados: listas, &aacute;rvores bin&aacute;rias &ndash; 4 Aulas</li>
					<li>Abstra&ccedil;&atilde;o de dados: filas, tabelas &ndash; 4 Aulas</li>
					<li>Algoritmos de ordena&ccedil;&atilde;o: BubleSort &ndash; 4 Aulas</li>
					<li>Algoritmos de ordena&ccedil;&atilde;o: InsertSort e QuickSort &ndash; 4 Aulas</li>
					<li>Lista de exerc&iacute;cios 3 &ndash; 4 Aulas</li>
					<li>Avalia&ccedil;&atilde;o 3 &ndash; 4 Aulas</li>
				</ul>

				<h2>Metodologia</h2>

				<p>As aulas ser&atilde;o conduzidas de maneira expositivo-dialogadas, com exerc&iacute;cios pr&aacute;ticos e atividades individuais e em grupo, O principal foco do desenvolvimento do conhecimento ser&aacute; atrav&eacute;s da resolu&ccedil;&atilde;o de exerc&iacute;cios para cada assunto estudado, colabora&ccedil;&atilde;o coletiva e no final, an&aacute;lise e discuss&atilde;o dos resultados. O professor ir&aacute; atuar como intermedi&aacute;rio para que o aluno no final da disciplina consiga resolver ativamente problemas do mundo real com o uso dos assuntos abordados. O material did&aacute;tico ser&aacute; disponibilizado de forma a guiar o desenvolvimento das aulas, com complementa&ccedil;&atilde;o atrav&eacute;s de livros e pesquisas na internet, al&eacute;m da utiliza&ccedil;&atilde;o de conte&uacute;dos multim&iacute;dia como sites, blogs e v&iacute;deos. As aulas ser&atilde;o realizadas em sala de aula, onde ser&atilde;o abordadas as atividades que envolvem racioc&iacute;nio l&oacute;gico e, quando necess&aacute;rio, no laborat&oacute;rio de inform&aacute;tica para o desenvolvimento das atividades pr&aacute;ticas.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>A nota final ser&aacute; composta de 3 avalia&ccedil;&otilde;es, no formato de provas e 3 listas de exerc&iacute;cios. A primeira prova e a primeira lista de exerc&iacute;cios englobam os assuntos relacionados com a programa&ccedil;&atilde;o em C e a abstra&ccedil;&atilde;o procedural. A segunda prova e a segunda lista de exerc&iacute;cios englobam os assuntos relacionados com ponteiros, recursividade e iteratividade. A terceira prova e a terceira lista de exerc&iacute;cios englobam os assuntos relacionados com abstra&ccedil;&atilde;o de dados e algoritmos de ordena&ccedil;&atilde;o.</p>

				<p>A m&eacute;dia final (Mf) ser&aacute; composta da seguinte forma:</p>

				<p><strong>Ml = (L1 + L2 + L3) / 3<br />
				Mf = (A1 + A2 + A3 + Ml) / 4</strong></p>

				<p>Onde:<br />
				A1, A2 e A3 s&atilde;o as notas das avalia&ccedil;&otilde;es (Provas)<br />
				L1, L2 e L3 s&atilde;o as notas das listas de exerc&iacute;cios<br />
				Ml &eacute; a m&eacute;dia das listas de exerc&iacute;cios<br />
				Mf &eacute; a m&eacute;dia final</p>

				<p>Exame Final &ndash; Art. 61 &sect;1&ordm;. da resolu&ccedil;&atilde;o Consuper 057/2012 e PPC do Curso Considerar-se-&aacute; aprovado em um componente curricular o estudante que tiver frequ&ecirc;ncia igual ou superior a 75% (setenta e cinco por cento) do n&uacute;mero de aulas estabelecidas no semestre e alcan&ccedil;ar M&eacute;dia Final igual ou superior a 7,0 (sete v&iacute;rgula zero). Para o aluno aprovado sem exame, ser&aacute; atribu&iacute;do &agrave; Nota Final do componente curricular, o valor da m&eacute;dia final do mesmo. O aluno em exame ser&aacute; aprovado no componente curricular, quando a Nota Final for igual ou superior a 5,0 (cinco v&iacute;rgula zero), calculada da seguinte forma: NF = NE x 0,5 + MS x 0,5, sendo NF = NOTA FINAL, NE = NOTA EXAME, MF = M&Eacute;DIA FINAL. As recupera&ccedil;&otilde;es de notas (Exames Finais), arquivadas na Coordena&ccedil;&atilde;o de Registros Acad&ecirc;micos, s&oacute; podem ser revisadas atrav&eacute;s de solicita&ccedil;&atilde;o do estudante, em formul&aacute;rio pr&oacute;prio.</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>SCHILDT, Herbert. <strong>C completo e total.</strong> 3. ed. rev. e atual. S&atilde;o Paulo: Pearson, 1997.<br />
				MANZANO, Jos&eacute; Augusto N. G. <strong>Estudo dirigido de linguagem C. </strong>17. ed. rev. e atual. S&atilde;o Paulo: &Eacute;rica, 2013.<br />
				FEOFILOFF, Paulo. <strong>Algoritmos em linguagem C</strong>. S&atilde;o Paulo: Campus, 2008.</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>MANZANO, Jos&eacute; Augusto N. G.; OLIVEIRA, Jayr Figueiredo de. <strong>Algoritmos: L&oacute;gica para desenvolvimento de programa&ccedil;&atilde;o de computadores. </strong>27. ed. rev. S&atilde;o Paulo: &Eacute;rica, 2014.<br />
				MANZANO, Jos&eacute; Augusto N. G.; OLIVEIRA, Jayr Figueiredo de. <strong>Estudo dirigido de algoritmos.</strong> 15. ed. rev. S&atilde;o Paulo: &Eacute;rica, 2012.<br />
				MAR&Ccedil;ULA, Marcelo; BENINI FILHO, Pio Armando. <strong>Inform&aacute;tica: conceitos e aplica&ccedil;&otilde;es. </strong>3. ed. rev. S&atilde;o Paulo: &Eacute;rica, 2008.<br />
				VELLOSO, Fernando de Castro.<strong> Inform&aacute;tica: conceitos b&aacute;sicos. </strong>8. ed. Rio de Janeiro: Elsevier, 2011.<br />
				PEREIRA, Silvio do Lago. <strong>Algoritmos e l&oacute;gica de programa&ccedil;&atilde;o em C: uma abordagem did&aacute;tica.</strong> S&atilde;o Paulo: &Eacute;rica, 2010.</p>

            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
