<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark">
            <div class="container">
                <a class="navbar-brand" href="#">Ricardo Kerschbaumer</a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation"><span class="navbar-toggler-icon"></span></button>
                <div class="collapse navbar-collapse" id="navbarSupportedContent">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link active" aria-current="page" href="index.html">Home</a></li>
                        <!-- <li class="nav-item"><a class="nav-link" href="sistemasDigitais.html">Sistemas Digitais</a></li> -->
                        <li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Disciplinas</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="AlgoritmoseEstruturasdaInformação.html">Algoritmos e Estruturas da Informação</a></li>
								<li><a class="dropdown-item" href="ControledeProcessos.html">Controle de Processos</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaECA.html">Eletrônica Básica ECA</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaTAI.html">Eletrônica Básica TAI</a></li>
								<li><a class="dropdown-item" href="EletronicaDigitalTAI.html">Eletrônica Digital TAI</a></li>
								<li><a class="dropdown-item" href="LogicaReconfiguravel.html">Lógica Reconfigurável</a></li>
								<li><a class="dropdown-item" href="MicrocontroladoresExperimental.html">Microcontroladores Experimental</a></li>
								<li><a class="dropdown-item" href="ProgramacaoAplicadaaMicrocontroladores.html">Programação Aplicada a Microcontroladores</a></li>
								<li><a class="dropdown-item" href="ProjetocomSistemasMicrocontrolados.html">Projeto com Sistemas Microcontrolados</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorI.html">Projeto Integrador I</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorII.html">Projeto Integrador II</a></li>
								<li><a class="dropdown-item" href="SistemasDigitais.html">Sistemas Digitais</a></li>
								<li><a class="dropdown-item" href="SistemasDigitaisExperimental.html">Sistemas Digitais Experimental</a></li>
								<li><a class="dropdown-item" href="TopicosemInteligênciaArtificial.html">Tópicos em Inteligência Artificial</a></li>
                                <!-- <li><hr class="dropdown-divider" /></li> -->
                            </ul>
                        </li>
						<li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Outros</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="Anexos/Fabricação de placas na JLCPCB.pdf">Fabricação de placas na JLCPCB</a></li>
								<li><a class="dropdown-item" href="Anexos/Projeto de Placas de Circuito - SECITEC.pdf">Projeto de Placas de Circuito - SECITEC</a></li>
                            </ul>
                        </li>
                    </ul>
                </div>
            </div>
        </nav>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Controle de Processos</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Ementa</h2>

				<p>Defini&ccedil;&otilde;es B&aacute;sicas: Vari&aacute;veis de uma Malha de Controle, Ru&iacute;do, Erro, Perturba&ccedil;&atilde;o; Principais Processos Industriais; Caracter&iacute;sticas de Processos: Continuidade, Diagramas de Instrumenta&ccedil;&atilde;o, Diagramas de Blocos, Constante de Tempo, Ganho, Tempo Morto, Capacit&acirc;ncia, Resist&ecirc;ncia, No&ccedil;&otilde;es B&aacute;sicas de Respostas de Sistemas de Primeira e Segunda Ordem; Tipos de Controle: Malha Aberta, Malha Fechada, Manual, Autom&aacute;tico; A&ccedil;&otilde;es de Controle: Proporcional, Integral e Derivativo; No&ccedil;&otilde;es B&aacute;sicas dos Controladores PID; Controle em Cascata; M&eacute;todos de Sintonia das Malhas. Exemplos e atividades pr&aacute;ticas.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Apresentar os conceitos de controle de processos, possibilitando projetar e aplicas controladores PID para diversos tipos de processos industriais.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Conhecer os principais processos industriais;</li>
					<li>Saber interpretar um diagrama de malhas de controle;</li>
					<li>Introduzir os diagramas de instrumenta&ccedil;&atilde;o;</li>
					<li>Conhecer as principais caracter&iacute;sticas de controladores PID;</li>
					<li>Apresentar algumas t&eacute;cnicas de sintonia de controladores.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Introdu&ccedil;&atilde;o e apresenta&ccedil;&atilde;o do plano de curso. 4 aulas</li>
					<li>Defini&ccedil;&otilde;es B&aacute;sicas: Vari&aacute;veis de uma Malha de Controle, Ru&iacute;do, Erro, Perturba&ccedil;&atilde;o; Principais Processos Industriais. 8 aulas</li>
					<li>Caracter&iacute;sticas de Processos: Continuidade, Diagramas de Instrumenta&ccedil;&atilde;o, Diagramas de Blocos, Constante de Tempo, Ganho, Tempo Morto, Capacit&acirc;ncia, Resist&ecirc;ncia, No&ccedil;&otilde;es B&aacute;sicas de Respostas de Sistemas de Primeira e Segunda Ordem. 8 aulas</li>
					<li>Tipos de Controle: Malha Aberta, Malha Fechada, Manual, Autom&aacute;tico. 4 aulas</li>
					<li>Lista de exerc&iacute;cios 1 (L1). 4 aulas</li>
					<li>A&ccedil;&otilde;es de Controle: Proporcional, Integral e Derivativo. 4 aulas</li>
					<li>No&ccedil;&otilde;es B&aacute;sicas dos Controladores PID. 8 aulas</li>
					<li>Retomada e Lista de exerc&iacute;cios 2 (L2). 4 aulas</li>
					<li>Controle em Cascata. 4 aulas</li>
					<li>M&eacute;todos de Sintonia das Malhas. 4 aulas</li>
					<li>Exemplos e atividades pr&aacute;ticas. 12 aulas</li>
					<li>Lista de exerc&iacute;cios 3 (L3). 4 aulas</li>
					<li>Recupera&ccedil;&atilde;o de conte&uacute;dos e notas. 4 aulas</li>
				</ul>

				<h2>Metodologia</h2>

				<p>As aulas do segundo semestre ser&atilde;o ofertadas a partir de atividades de ensino remotas conforme Resolu&ccedil;&atilde;o 039/CONSUPER 2020;</p>

				<p>As aulas ser&atilde;o conduzidas de maneira expositiva com foco no di&aacute;logo e na discuss&atilde;o de cada um dos temas. Ser&atilde;o realizados exerc&iacute;cios te&oacute;ricos e pr&aacute;ticos bem como atividades individuais e em grupo. O principal foco do desenvolvimento do conhecimento ser&aacute; atrav&eacute;s da resolu&ccedil;&atilde;o de problemas e exerc&iacute;cios para cada um dos assuntos abordados.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>A nota ser&aacute;́ composta de tr&ecirc;s avalia&ccedil;&otilde;es. As avalia&ccedil;&otilde;es ser&atilde;o na forma de listas de exerc&iacute;cios, L1, L2 e L3. A nota final (Nf) &eacute; calculada da seguinte forma.</p>

				<p><strong>Nf = (L1 + L2 + L3) / 3;&nbsp;</strong></p>

				<p><strong>Recupera&ccedil;&atilde;o paralela&nbsp;</strong></p>

				<p>&Eacute; garantido ao aluno atividades de recupera&ccedil;&atilde;o de estudos, nos componentes curriculares em que n&atilde;o atingir rendimento suficiente no decorrer do per&iacute;odo letivo. Considera-se aqui, rendimento insuficiente, nota abaixo de 7,0 (sete v&iacute;rgula zero) mensurada atrav&eacute;s de instrumentos avaliativos.</p>

				<p>A recupera&ccedil;&atilde;o de estudos encontra amparo legal no art. 24, inciso V, al&iacute;nea e, da Lei de Diretrizes e Bases da Educa&ccedil;&atilde;o Nacional &ndash; LDB 9.394/96: &ldquo;Obrigatoriedade de estudos de recupera&ccedil;&atilde;o, de prefer&ecirc;ncia paralelos ao per&iacute;odo letivo, para os casos de baixo rendimento escolar, a serem disciplinados pelas institui&ccedil;&otilde;es de ensino em seus regimentos.&rdquo;</p>

				<p>Com efeito, a recupera&ccedil;&atilde;o visa o aperfei&ccedil;oamento da aprendizagem e n&atilde;o apenas do alcance da m&eacute;dia, ou seja, a preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos, consoante dita o art. 24 da LDB 9.394/96, inciso V, al&iacute;nea a, ao tratar dos crit&eacute;rios a serem observados na verifica&ccedil;&atilde;o do rendimento escolar: &ldquo;avalia&ccedil;&atilde;o cont&iacute;nua e cumulativa do desempenho do aluno, com preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos e dos resultados ao longo do per&iacute;odo sobre os de eventuais provas finais.&rdquo;</p>

				<p>A recupera&ccedil;&atilde;o de conte&uacute;dos, bem como a recupera&ccedil;&atilde;o de avalia&ccedil;&atilde;o (nota) s&atilde;o obrigat&oacute;rias. A recupera&ccedil;&atilde;o de conte&uacute;dos dever&aacute; ser realizada ao longo do ano letivo de forma paralela para todos os estudantes que apresentarem fragilidades de aprendizagem.</p>

				<p>A metodologia de recupera&ccedil;&atilde;o de notas empregada pelo campus dever&aacute; respeitar a Resolu&ccedil;&atilde;o 084/2014 do CONSUPER/IFC. Assim, a frequ&ecirc;ncia das reavalia&ccedil;&otilde;es dever&aacute; ser &uacute;nica, ao final do trimestre.</p>

				<p>&ndash; Exame Final &ndash; Art. 70 e Art. 71 da RESOLU&Ccedil;&Atilde;O N&ordm; 084 &ndash; CONSUPER/2014</p>

				<p>Considerar-se-&aacute; aprovado para o ano seguinte o estudante que tiver frequ&ecirc;ncia igual ou superior a 75% (setenta e cinco por cento) considerando a carga hor&aacute;ria total do curso e alcan&ccedil;ar M&eacute;dia Anual igual ou superior a 7,0 (sete v&iacute;rgula zero) em cada componente curricular. A M&eacute;dia Anual (MA) ser&aacute; a m&eacute;dia das notas finais de cada trimestre.</p>

				<p>O estudante que atingir M&eacute;dia Anual (MA) inferior a 7,0 (sete v&iacute;rgula zero) ter&aacute; direito &agrave; recupera&ccedil;&atilde;o de nota (Exame Final). A recupera&ccedil;&atilde;o de notas (Exame Final) &eacute; uma avalia&ccedil;&atilde;o composta por todo o conte&uacute;do ministrado no ano de cada componente curricular, que tenha sido devidamente recuperado em termos de aprendizagem, e tem por objetivo recuperar as notas dos estudantes que n&atilde;o obtiveram aproveitamento igual ou superior a 7,0 (sete v&iacute;rgula zero) em cada componente curricular.</p>

				<p>O aluno em exame ser&aacute; aprovado no componente curricular, quando a M&eacute;dia Final (MF) for igual ou superior a 5,0 (cinco v&iacute;rgula zero), calculada da seguinte forma:</p>

				<p>MF = NE x 0,4 + MA x 0,6, sendo</p>

				<p>MF = M&Eacute;DIA FINAL,</p>

				<p>NE = NOTA EXAME,</p>

				<p>MA = M&Eacute;DIA ANUAL.</p>

				<p>Para o c&aacute;lculo da m&eacute;dia final (MF), leva-se em considera&ccedil;&atilde;o que a avalia&ccedil;&atilde;o do desempenho do estudante deve ser cont&iacute;nua e cumulativa, com preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos e dos resultados ao longo do per&iacute;odo sobre as eventuais provas finais.</p>

				<p>As recupera&ccedil;&otilde;es de notas (Exames Finais), arquivadas na Coordena&ccedil;&atilde;o de Registros Acad&ecirc;micos, s&oacute; podem ser revisadas atrav&eacute;s de solicita&ccedil;&atilde;o do estudante, em formul&aacute;rio pr&oacute;prio.</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>ALVES, Jos&eacute; L. L. Instrumenta&ccedil;&atilde;o, Controle e Automa&ccedil;&atilde;o de Processos. 2a ed. Rio de Janeiro: LTC, 2010.<br />
				FRANCHI, Moro Franchi. Controle de Processos Industriais. 1a ed. S&atilde;o Paulo. &Eacute;rica, 2011.<br />
				CAMPOS, Mario Cesar M. Massa de; TEIXEIRA, Herbert C. G. Controles t&iacute;picos de equipamentos e processos industriais. 2 ed. S&atilde;o Paulo: Blucher, 2010.</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>OGATA, Katsuhiko. Engenharia de Controle Moderno. 4. ed. S&atilde;o Paulo: Prentice-Hall, 2003.<br />
				MIKELI P. Groover, Automa&ccedil;&atilde;o Industrial e Sistemas de Manufatura, 3a ed. S&atilde;o Paulo, Pearson Prentice Hall, 2011.<br />
				CAPELLI, Alexandre, Automa&ccedil;&atilde;o Industrial: Controle do Movimento e Processos Cont&iacute;nuos, 2a ed. S&atilde;o Paulo, &Eacute;rica, 2008.<br />
				AGUIRRE, Luis Antonio, Enciclop&eacute;dia de Autom&aacute;tica: Controle e Automa&ccedil;&atilde;o, volume II. 1a ed. S&atilde;o Paulo, Blucher, 2007.<br />
				FRANCHI, Claiton Moro. Controladores l&oacute;gicos program&aacute;veis: sistemas discretos. 2. ed. S&atilde;o Paulo: &Eacute;rica, 2013.</p>

            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
