<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark">
            <div class="container">
                <a class="navbar-brand" href="#">Ricardo Kerschbaumer</a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation"><span class="navbar-toggler-icon"></span></button>
                <div class="collapse navbar-collapse" id="navbarSupportedContent">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link active" aria-current="page" href="index.html">Home</a></li>
                        <!-- <li class="nav-item"><a class="nav-link" href="sistemasDigitais.html">Sistemas Digitais</a></li> -->
                        <li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Disciplinas</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="AlgoritmoseEstruturasdaInformação.html">Algoritmos e Estruturas da Informação</a></li>
								<li><a class="dropdown-item" href="CalculoNumerico.html">Cálculo Numérico</a></li>
								<li><a class="dropdown-item" href="ControledeProcessos.html">Controle de Processos</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaECA.html">Eletrônica Básica ECA</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaTAI.html">Eletrônica Básica TAI</a></li>
								<li><a class="dropdown-item" href="EletronicaDigitalTAI.html">Eletrônica Digital TAI</a></li>
								<li><a class="dropdown-item" href="LogicaReconfiguravel.html">Lógica Reconfigurável</a></li>
								<li><a class="dropdown-item" href="MicrocontroladoresExperimental.html">Microcontroladores Experimental</a></li>
								<li><a class="dropdown-item" href="ProgramacaoAplicadaaMicrocontroladores.html">Programação Aplicada a Microcontroladores</a></li>
								<li><a class="dropdown-item" href="ProjetocomSistemasMicrocontrolados.html">Projeto com Sistemas Microcontrolados</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorI.html">Projeto Integrador I</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorII.html">Projeto Integrador II</a></li>
								<li><a class="dropdown-item" href="SistemasDigitais.html">Sistemas Digitais</a></li>
								<li><a class="dropdown-item" href="SistemasDigitaisExperimental.html">Sistemas Digitais Experimental</a></li>
								<li><a class="dropdown-item" href="TopicosemInteligênciaArtificial.html">Tópicos em Inteligência Artificial</a></li>
                                <!-- <li><hr class="dropdown-divider" /></li> -->
                            </ul>
                        </li>
						<li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Outros</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="Anexos/Fabricação de placas na JLCPCB.pdf">Fabricação de placas na JLCPCB</a></li>
								<li><a class="dropdown-item" href="Anexos/Projeto de Placas de Circuito - SECITEC.pdf">Projeto de Placas de Circuito - SECITEC</a></li>
                            </ul>
                        </li>
                    </ul>
                </div>
            </div>
        </nav>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Eletr&ocirc;nica B&aacute;sica ECA</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Ementa</h2>

				<p>No&ccedil;&otilde;es de f&iacute;sica dos semicondutores. Diodo de jun&ccedil;&atilde;o. Circuitos com diodos: retificador, ceifador, grampeador. Diodo zener e suas aplica&ccedil;&otilde;es. Transistores BJT, JFET e MOSFET: princ&iacute;pios de opera&ccedil;&atilde;o, an&aacute;lise e projeto de circuitos de polariza&ccedil;&atilde;o, an&aacute;lise e projeto de amplificadores para pequenos sinais. Amplificador operacional ideal, an&aacute;lise de circuitos com amplificadores operacionais ideais e principais configura&ccedil;&otilde;es de aplica&ccedil;&atilde;o. Fontes de alimenta&ccedil;&atilde;o CC reguladas com componentes discretos.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Desenvolver habilidades para an&aacute;lise de circuitos eletr&ocirc;nicos utilizando componentes semicondutores.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Obter fundamentos b&aacute;sicos sobre dispositivos semicondutores;</li>
					<li>Estudar os principais tipos de diodos e suas aplica&ccedil;&otilde;es;</li>
					<li>Estudar os principais tipos de transistores (BJT, JFET e MOSFET);</li>
					<li>Analisar as aplica&ccedil;&otilde;es dos transistores em circuitos CC e CA;</li>
					<li>Analisar circuitos eletr&ocirc;nicos b&aacute;sicos com diodos e transistores;</li>
					<li>Estudar o funcionamento do amplificador operacional;</li>
					<li>Compreender as principais aplica&ccedil;&otilde;es do amp-op.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do plano de aula e introdu&ccedil;&atilde;o a disciplina. 1 encontro.</li>
					<li>No&ccedil;&otilde;es de f&iacute;sica dos semicondutores. 2 encontros.</li>
					<li>Diodo de jun&ccedil;&atilde;o. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre diodo de jun&ccedil;&atilde;o. 1 encontro.</li>
					<li>Circuitos com diodos: retificador. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre circuitos com diodos, retificador. 1 encontro.</li>
					<li>Circuitos com diodos: ceifador, grampeador. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre circuitos com diodos, ceifador, grampeador. 1 encontro.</li>
					<li>Diodo zener e suas aplica&ccedil;&otilde;es. Exerc&iacute;cios sobre diodo zener e suas aplica&ccedil;&otilde;es. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 1 (N1). 3 encontros.</li>
					<li>Transistores BJT: princ&iacute;pios de opera&ccedil;&atilde;o. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre transistores BJT, princ&iacute;pios de opera&ccedil;&atilde;o. 1 encontro.</li>
					<li>Transistores: an&aacute;lise e projeto de circuitos de polariza&ccedil;&atilde;o, an&aacute;lise e projeto de amplificadores para pequenos sinais. 2 encontros.</li>
					<li>Exerc&iacute;cios sobre transistores, an&aacute;lise e projeto de circuitos de polariza&ccedil;&atilde;o, an&aacute;lise e projeto de amplificadores para pequenos sinais. 1 encontro.</li>
					<li>Transistores JFET: princ&iacute;pios de opera&ccedil;&atilde;o. 1 encontro.</li>
					<li>Transistores MOSFET: princ&iacute;pios de opera&ccedil;&atilde;o. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre transistores JFET e MOSFET. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 2 (N2). 3 encontros.</li>
					<li>Amplificador operacional ideal. 1 encontro.</li>
					<li>An&aacute;lise de circuitos com amplificadores operacionais ideais e principais configura&ccedil;&otilde;es de aplica&ccedil;&atilde;o. 3 encontros.</li>
					<li>Exerc&iacute;cios sobre an&aacute;lise de circuitos com amplificadores operacionais ideais e principais configura&ccedil;&otilde;es de aplica&ccedil;&atilde;o. 1 encontro.</li>
					<li>Fontes de alimenta&ccedil;&atilde;o CC reguladas com componentes discretos. 1 encontro.</li>
					<li>Exerc&iacute;cios sobre fontes de alimenta&ccedil;&atilde;o CC reguladas com componentes discretos. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 3 (N3). 4 encontros.</li>
				</ul>

				<h2>Metodologia</h2>

				<p>A disciplina ser&aacute; conduzida sob o enfoque da constru&ccedil;&atilde;o do conhecimento, do processo de ensino-aprendizagem, orientando o desenvolvimento do saber acad&ecirc;mico a partir de seus pr&oacute;prios valores e no&ccedil;&otilde;es da realidade.<br />
				As Atividades de ensino remotas ser&atilde;o ofertadas de acordo com as resolu&ccedil;&otilde;es vigentes e per&iacute;odos autorizados<br />
				Para a realiza&ccedil;&atilde;o das atividades remotas ser&atilde;o utilizadas aulas s&iacute;ncronas por webconfer&ecirc;ncia com exposi&ccedil;&atilde;o do conte&uacute;do, estas aulas ser&atilde;o gravadas e disponibilizadas aos alunos. Tamb&eacute;m ser&atilde;o utilizados simuladores computacionais e v&iacute;deos did&aacute;ticos de forma a complementar as aulas.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>No decorrer do semestre letivo ser&atilde;o realizadas 3 avalia&ccedil;&otilde;es de dom&iacute;nio de conhecimento com notas de 0,0 a 10,0.</p>

				<p>Sendo: <strong>MF = (N1+N2+N3)/3.</strong></p>

				<p>Estas avalia&ccedil;&otilde;es ser&atilde;o na forma de listas de exerc&iacute;cios, realizadas de forma ass&iacute;ncrona pelos alunos, com o apoio do professor durante determinados momentos s&iacute;ncronos conforme cronograma de atividades.</p>

				<p>Sistema de avalia&ccedil;&atilde;o: instrumentos e valores, conforme Resolu&ccedil;&atilde;o 057/CONSUPER. Exame Final &ndash; Art. 61 &sect;1&ordm;. da resolu&ccedil;&atilde;o Consuper 057/2012 e PPC do Curso<br />
				Considerar-se-&aacute; aprovado em um componente curricular o estudante que tiver frequ&ecirc;ncia igual ou superior a 75% (setenta e cinco por cento) do n&uacute;mero de aulas estabelecidas no semestre e alcan&ccedil;ar M&eacute;dia Final igual ou superior a 7,0 (sete v&iacute;rgula zero).<br />
				Para o aluno aprovado sem exame, ser&aacute; atribu&iacute;do &agrave; Nota Final do componente curricular, o valor da m&eacute;dia final do mesmo.<br />
				O aluno em exame ser&aacute; aprovado no componente curricular, quando a Nota Final for igual ou superior a 5,0 (cinco v&iacute;rgula zero), calculada da seguinte forma:<br />
				NF = NE x 0,5 + MS x 0,5, sendo<br />
				NF = NOTA FINAL,<br />
				NE = NOTA EXAME,<br />
				MF = M&Eacute;DIA FINAL.<br />
				As recupera&ccedil;&otilde;es de notas (Exames Finais), arquivadas na Coordena&ccedil;&atilde;o de Registros Acad&ecirc;micos, s&oacute; podem ser revisadas atrav&eacute;s de solicita&ccedil;&atilde;o do estudante, em formul&aacute;rio pr&oacute;prio.</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>BOYLESTAD, Robert L.; NASHELSKY, Louis. <strong>Dispositivos Eletr&ocirc;nicos e teoria de circuitos,</strong> 8. ed. &ndash; S&atilde;o Paulo: Pearson Prentice Hall, 2004.<br />
				MARQUES, Angelo Eduardo B.; CRUZ, Eduardo Cesar A.; CHOUERI JR, Salom&atilde;o. <strong>Dispositivos semicondutores: diodos e transistores.</strong> 12. ed. S&atilde;o Paulo: &Eacute;rica, 2010.<br />
				CRUZ, Eduardo Cesar A; CHOUERI JR., Salom&atilde;o. <strong>Eletr&ocirc;nica aplicada. </strong>2. ed. S&atilde;o Paulo: &Eacute;rica, 2008.</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>SCHULER, Charles.<strong> Eletr&ocirc;nica I.</strong> 7.ed. Porto Alegre: AMGH, 2013. v.1. (s&eacute;rie Tekne).<br />
				SCHULER, Charles. <strong>Eletr&ocirc;nica II. </strong>7.ed. Porto Alegre: AMGH, 2013. v.2. (s&eacute;rie Tekne).<br />
				MARKUS, Ot&aacute;vio. <strong>Sistemas anal&oacute;gicos circuitos com diodos e transistores.</strong> 8. ed. S&atilde;o Paulo: &Eacute;rica, 2008.<br />
				CIPELLI, Antonio Marco Vicari; SANDRINI, Waldir Jo&atilde;o; MARKUS, Ot&aacute;vio. <strong>Teoria e desenvolvimento de projetos de circuitos eletr&ocirc;nicos. </strong>23. ed. S&atilde;o Paulo: &Eacute;rica, 2007.<br />
				MALVINO, Albert Paul. <strong>Eletr&ocirc;nica.</strong> 4. ed. S&atilde;o Paulo, SP: Makron Books do Brasil, 1997. v. 1.<br />
				MALVINO, Albert Paul. <strong>Eletr&ocirc;nica.</strong> 4. ed. S&atilde;o Paulo, SP: Makron Books do Brasil, 1997. v. 2.<br />
				SEDRA, Adel S.; SMITH, Kenneth C. <strong>Microeletr&ocirc;nica. </strong>5. ed. S&atilde;o Paulo: Pearson Prentice Hall, 2007.</p>

            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
