<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark">
            <div class="container">
                <a class="navbar-brand" href="#">Ricardo Kerschbaumer</a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation"><span class="navbar-toggler-icon"></span></button>
                <div class="collapse navbar-collapse" id="navbarSupportedContent">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link active" aria-current="page" href="index.html">Home</a></li>
                        <!-- <li class="nav-item"><a class="nav-link" href="sistemasDigitais.html">Sistemas Digitais</a></li> -->
                        <li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Disciplinas</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="AlgoritmoseEstruturasdaInformação.html">Algoritmos e Estruturas da Informação</a></li>
								<li><a class="dropdown-item" href="ControledeProcessos.html">Controle de Processos</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaECA.html">Eletrônica Básica ECA</a></li>
								<li><a class="dropdown-item" href="EletronicaBasicaTAI.html">Eletrônica Básica TAI</a></li>
								<li><a class="dropdown-item" href="EletronicaDigitalTAI.html">Eletrônica Digital TAI</a></li>
								<li><a class="dropdown-item" href="LogicaReconfiguravel.html">Lógica Reconfigurável</a></li>
								<li><a class="dropdown-item" href="MicrocontroladoresExperimental.html">Microcontroladores Experimental</a></li>
								<li><a class="dropdown-item" href="ProgramacaoAplicadaaMicrocontroladores.html">Programação Aplicada a Microcontroladores</a></li>
								<li><a class="dropdown-item" href="ProjetocomSistemasMicrocontrolados.html">Projeto com Sistemas Microcontrolados</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorI.html">Projeto Integrador I</a></li>
								<li><a class="dropdown-item" href="ProjetoIntegradorII.html">Projeto Integrador II</a></li>
								<li><a class="dropdown-item" href="SistemasDigitais.html">Sistemas Digitais</a></li>
								<li><a class="dropdown-item" href="SistemasDigitaisExperimental.html">Sistemas Digitais Experimental</a></li>
								<li><a class="dropdown-item" href="TopicosemInteligênciaArtificial.html">Tópicos em Inteligência Artificial</a></li>
                                <!-- <li><hr class="dropdown-divider" /></li> -->
                            </ul>
                        </li>
						<li class="nav-item dropdown">
                            <a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Outros</a>
                            <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
                                <li><a class="dropdown-item" href="Anexos/Fabricação de placas na JLCPCB.pdf">Fabricação de placas na JLCPCB</a></li>
								<li><a class="dropdown-item" href="Anexos/Projeto de Placas de Circuito - SECITEC.pdf">Projeto de Placas de Circuito - SECITEC</a></li>
                            </ul>
                        </li>
                    </ul>
                </div>
            </div>
        </nav>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Eletr&ocirc;nica Digital TAI</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Material Auxiliar</h2>

				<p><a href="Anexos/Apostila Sistemas Digitais Kerschbaumer.pdf">Apostila Sistemas Digitais Kerschbaumer</a></p>

				<h2>Eixo tecnol&oacute;gico: Controle e Processos industriais</h2>

				<h2>Ementa</h2>

				<p>Conceito de Sinal Digital; Sistema de Numera&ccedil;&atilde;o e Codifica&ccedil;&atilde;o: Bin&aacute;rio, Decimal, Hexadecimal e BCD; Portas L&oacute;gicas, &Aacute;lgebra Booleana, Circuitos L&oacute;gicos Combinacionais: Multiplexador, Demultiplexador, Codificador, Decodificador; Conversores D/A e A/D: Aplica&ccedil;&otilde;es, Resolu&ccedil;&atilde;o e Escala; Circuitos L&oacute;gicos Sequenciais: Flip-Flop&rsquo;s, Registradores, Contadores, Mem&oacute;rias.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Desenvolver compet&ecirc;ncias e habilidades te&oacute;ricas e pr&aacute;ticas relativas a montagens de circuitos eletr&ocirc;nicos digitais e a compreens&atilde;o de seu funcionamento.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Entendimento dos sinais anal&oacute;gicos e digitais e a convers&atilde;o entre estes;</li>
					<li>&nbsp;Familiarizar-se com os princ&iacute;pios de sistemas num&eacute;ricos e bases;</li>
					<li>&nbsp;Compreender e aplicar os princ&iacute;pios de &aacute;lgebra e l&oacute;gica booleana;</li>
					<li>&nbsp;Conhecer e identificar os principais componentes de circuitos l&oacute;gicos digitais;</li>
					<li>&nbsp;Conhecer as t&eacute;cnicas de an&aacute;lise e s&iacute;ntese de circuitos l&oacute;gicos digitais;</li>
					<li>&nbsp;Conhecer os conceitos de mem&oacute;rias semicondutoras.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do plano de ensino e Introdu&ccedil;&atilde;o aos Sistemas Digitais. 1 encontro.</li>
					<li>Conceito de Sinal Digital e Sistemas de Numera&ccedil;&atilde;o. 1 encontro.</li>
					<li>Portas L&oacute;gicas. 1 encontro.</li>
					<li>&Aacute;lgebra Booleana. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 1 (N1). 1 encontro.</li>
					<li>Circuitos L&oacute;gicos Combinacionais. 1 encontro.</li>
					<li>Multiplexador. 1 encontro.</li>
					<li>Demultiplexador. 1 encontro.</li>
					<li>Codificador. 1 encontro.</li>
					<li>Decodificador. 1 encontro.</li>
					<li>Conversores D/A e A/D:Aplica&ccedil;&otilde;es, Resolu&ccedil;&atilde;o e Escala. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 2 (N2). 1 encontro.</li>
					<li>Circuitos L&oacute;gicos Sequenciais: Flip-Flop&rsquo;s. 1 encontro.</li>
					<li>Registradores. 1 encontro.</li>
					<li>Contadores. 1 encontro.</li>
					<li>Mem&oacute;rias. 1 encontro.</li>
					<li>Lista de exerc&iacute;cios 3 (N3). 1 encontro.</li>
					<li>Recupera&ccedil;&atilde;o de conte&uacute;dos e notas. 1 encontro.</li>
				</ul>

				<h2>Metodologia</h2>

				<p>As aulas ser&atilde;o conduzidas de maneira expositiva com foco no di&aacute;logo e na discuss&atilde;o de cada um dos temas. Ser&atilde;o realizados exerc&iacute;cios te&oacute;ricos e pr&aacute;ticos bem como atividades individuais e em grupo. O principal foco do desenvolvimento do conhecimento ser&aacute; atrav&eacute;s da resolu&ccedil;&atilde;o de problemas e exerc&iacute;cios para cada um dos assuntos abordados e da colabora&ccedil;&atilde;o coletiva.<br />
				As Atividades de ensino remotas ser&atilde;o ofertadas de acordo com as resolu&ccedil;&otilde;es vigentes e per&iacute;odos autorizados.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>As avalia&ccedil;&otilde;es ser&atilde;o realizadas atrav&eacute;s da realiza&ccedil;&atilde;o de 3 listas de exerc&iacute;cios (N1, N2 e N3). A nota final (Nf) &eacute; calculada da seguinte forma.</p>

				<p><strong>Nf = (N1 + N2 + N3) / 3.</strong></p>

				<p>Sistema de avalia&ccedil;&atilde;o: instrumentos e valores, conforme Resolu&ccedil;&atilde;o 084/CONSUPER.</p>

				<p><strong>Recupera&ccedil;&atilde;o paralela</strong><br />
				&Eacute; garantido ao aluno atividades de recupera&ccedil;&atilde;o de estudos, nos componentes curriculares em que n&atilde;o atingir rendimento suficiente no decorrer do per&iacute;odo letivo. Considera-se aqui, rendimento insuficiente, nota abaixo de 7,0 (sete v&iacute;rgula zero) mensurada atrav&eacute;s de instrumentos avaliativos.<br />
				A recupera&ccedil;&atilde;o de estudos encontra amparo legal no art. 24, inciso V, al&iacute;nea e, da Lei de Diretrizes e Bases da Educa&ccedil;&atilde;o Nacional &ndash; LDB 9.394/96: &ldquo;Obrigatoriedade de estudos de recupera&ccedil;&atilde;o, de prefer&ecirc;ncia paralelos ao per&iacute;odo letivo, para os casos de baixo rendimento escolar, a serem disciplinados pelas institui&ccedil;&otilde;es de ensino em seus regimentos.&rdquo;<br />
				Com efeito, a recupera&ccedil;&atilde;o visa o aperfei&ccedil;oamento da aprendizagem e n&atilde;o apenas do alcance da m&eacute;dia, ou seja, a preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos, consoante dita o art. 24 da LDB 9.394/96, inciso V, al&iacute;nea a, ao tratar dos crit&eacute;rios a serem observados na verifica&ccedil;&atilde;o do rendimento escolar: &ldquo;avalia&ccedil;&atilde;o cont&iacute;nua e cumulativa do desempenho do aluno, com preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos e dos resultados ao longo do per&iacute;odo sobre os de eventuais provas finais.&rdquo;<br />
				A recupera&ccedil;&atilde;o de conte&uacute;dos, bem como a recupera&ccedil;&atilde;o de avalia&ccedil;&atilde;o (nota) s&atilde;o obrigat&oacute;rias. A recupera&ccedil;&atilde;o de conte&uacute;dos dever&aacute; ser realizada ao longo do ano letivo de forma paralela para todos os estudantes que apresentarem fragilidades de aprendizagem.<br />
				A metodologia de recupera&ccedil;&atilde;o de notas empregada pelo campus dever&aacute; respeitar a Resolu&ccedil;&atilde;o 084/2014 do CONSUPER/IFC. Assim, a frequ&ecirc;ncia das reavalia&ccedil;&otilde;es dever&aacute; ser &uacute;nica, ao final do trimestre. &ndash; Exame Final &ndash; Art. 70 e Art. 71 da RESOLU&Ccedil;&Atilde;O N&ordm; 084 &ndash; CONSUPER/2014</p>

				<p><br />
				<strong>Exame Final</strong>&nbsp;&ndash; Art. 70 e Art. 71 da RESOLU&Ccedil;&Atilde;O N&ordm; 084 &ndash; CONSUPER/2014:<br />
				Considerar-se-&aacute; aprovado para o ano seguinte o estudante que tiver frequ&ecirc;ncia igual ou superior a 75% (setenta e cinco por cento) considerando a carga hor&aacute;ria total do curso e alcan&ccedil;ar M&eacute;dia Anual igual ou superior a 7,0 (sete v&iacute;rgula zero) em cada componente curricular. A M&eacute;dia Anual (MA) ser&aacute; a m&eacute;dia das notas finais de cada trimestre.</p>

				<p>O estudante que atingir M&eacute;dia Anual (MA) inferior a 7,0 (sete v&iacute;rgula zero) ter&aacute; direito &agrave; recupera&ccedil;&atilde;o de nota (Exame Final). A recupera&ccedil;&atilde;o de notas (Exame Final) &eacute; uma avalia&ccedil;&atilde;o composta por todo o conte&uacute;do ministrado no ano de cada componente curricular, que tenha sido devidamente recuperado em termos de aprendizagem, e tem por objetivo recuperar as notas dos estudantes que n&atilde;o obtiveram aproveitamento igual ou superior a 7,0 (sete v&iacute;rgula zero) em cada componente curricular.</p>

				<p>O aluno em exame ser&aacute; aprovado no componente curricular, quando a M&eacute;dia Final (MF) for igual ou superior a 5,0 (cinco v&iacute;rgula zero), calculada da seguinte forma:<br />
				MF = NE x 0,4 + MA x 0,6, sendo<br />
				MF = M&Eacute;DIA FINAL,<br />
				NE = NOTA EXAME,<br />
				MA = M&Eacute;DIA ANUAL.</p>

				<p>Para o c&aacute;lculo da m&eacute;dia final (MF), leva-se em considera&ccedil;&atilde;o que a avalia&ccedil;&atilde;o do desempenho do estudante deve ser cont&iacute;nua e cumulativa, com preval&ecirc;ncia dos aspectos qualitativos sobre os quantitativos e dos resultados ao longo do per&iacute;odo sobre as eventuais provas finais.<br />
				As recupera&ccedil;&otilde;es de notas (Exames Finais), arquivadas na Coordena&ccedil;&atilde;o de Registros Acad&ecirc;micos, s&oacute; podem ser revisadas atrav&eacute;s de solicita&ccedil;&atilde;o do estudante, em formul&aacute;rio pr&oacute;prio.</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>IDOETA, Ivan V.; CAPUANO, Francisco G.&nbsp;<strong>Elementos de eletr&ocirc;nica digital</strong>. 40a ed. S&atilde;o Paulo: &Eacute;rica, 2011.<br />
				TOCCI, Ronald J; WIDMER, Neal S; MOSS, Gregory L.&nbsp;<strong>Sistemas digitais: princ&iacute;pios e aplica&ccedil;&otilde;es</strong>. 11a ed. S&atilde;o Paulo: Pearson, 2011.<br />
				LOUREN&Ccedil;O A. C.&nbsp;<strong>Circuitos Digitais &ndash; Use e Estude</strong>. 9&ordf; Edi&ccedil;&atilde;o. Ed. &Eacute;rica. 2009.</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>GARUE, Sergio.&nbsp;<strong>Eletr&ocirc;nica digital: circuitos e tecnologias LSI e VLSI</strong>. S&atilde;o Paulo, SP: Hemus, 19??.<br />
				PEDRONI, Volnei A.&nbsp;<strong>Eletr&ocirc;nica digital moderna e VHDL</strong>. Rio de Janeiro, RJ: Elsevier, 2010.<br />
				BIGNELL, James; DONOVAN, Robert.&nbsp;<strong>Eletr&ocirc;nica digital</strong>. S&atilde;o Paulo: Cencage Learning, 2010.<br />
				MALVINO, Albert Paul; LEACH, Donald P.&nbsp;<strong>Eletr&ocirc;nica digital: princ&iacute;pios e aplica&ccedil;&otilde;es.</strong>&nbsp;S&atilde;o Paulo: McGraw &ndash; Hill, c1988. 2 v.<br />
				GARCIA, Paulo Alves; MARTINI, Jos&eacute; Sidnei Colombo.&nbsp;<strong>Eletr&ocirc;nica digital: teoria e laborat&oacute;rio</strong>. 2. ed. S&atilde;o Paulo: &Eacute;rica, 2008. 182 p.</p>

            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
