<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <div id="menu-placeholder"></div>
			<script>
			  fetch('menu.html')
				.then(response => response.text())
				.then(data => {
				  document.getElementById('menu-placeholder').innerHTML = data;
				})
				.catch(error => console.error('Erro ao carregar o menu:', error));
			</script>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Lógica Reconfigurável</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Material Auxiliar</h2>
				<p><a href="Anexos/Introducao.pdf">Slides de Introdu&ccedil;&atilde;o a L&oacute;gica Reconfigur&aacute;vel</a></p>
				<p><a href="Anexos/Apostila Sistemas Digitais Kerschbaumer.pdf">Apostila Sistemas Digitais Kerschbaumer</a></p>
				<p>Simulador utilizado nas aulas Hneemann Digital <a href="https://github.com/hneemann/Digital">https://github.com/hneemann/Digital</a></p>
				<p><a href="Anexos/Simulação VHDL no Digital.pdf">Simulação VHDL no Digital </a></p>
				<p>Compilador utilizado nas aulas, Intel® Quartus Prime: <a href="https://www.intel.com.br/content/www/br/pt/software/programmable/quartus-prime/download.html">Quartus Prime</a></p>
				<p><a href="Anexos/Driver USB-Blaster Antigo.zip">Driver USB-Blaster Antigo (sem assinatura digital)</a></p>
				<p><a href="Anexos/Instalacao USB-Blaster Antigo.pdf">Passo a passo instala&ccedil;&atilde;o USB-Blaster Antigo</a></p>
				<p><a href="Anexos/IntroducaoVHDL.pdf">Introdu&ccedil;&atilde;o ao VHDL</a></p>
				<p><a href="Anexos/ExercicioHneemannDigital.pdf">Exerc&iacute;cio Hneemann Digital.pdf</a></p>				
				
				<h2>Ementa</h2>

				<p>Fundamentos de l&oacute;gica reconfigur&aacute;vel. Estudo dos dispositivos l&oacute;gicos reconfigur&aacute;veis. Estudo de uma linguagem para s&iacute;ntese de circuitos em dispositivos l&oacute;gicos reconfigur&aacute;veis. Estudo de ferramentas de EDA (Electronic Design Automation) para o desenvolvimento automatizado de projetos e simula&ccedil;&otilde;es de circuitos em l&oacute;gica reconfigur&aacute;vel. Desenvolvimento de projetos de circuitos digitais em l&oacute;gica reconfigur&aacute;vel utilizando diagramas de blocos, linguagem de s&iacute;ntese e m&aacute;quinas de estados.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Apresentar aos alunos os fundamentos da l&oacute;gica reconfigur&aacute;vel, os principais dispositivos envolvidos e as formas de s&iacute;ntese utilizadas em sua programa&ccedil;&atilde;o. Apresentar tamb&eacute;m as principais ferramentas de design, s&iacute;ntese e simula&ccedil;&atilde;o de sistemas digitais em dispositivos l&oacute;gicos reconfigur&aacute;veis.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Apresentar os fundamentos de l&oacute;gica reconfigur&aacute;vel.</li>
					<li>Realizar o estudo dos dispositivos l&oacute;gicos reconfigur&aacute;veis.</li>
					<li>Realizar o estudo das principais linguagens de s&iacute;ntese de circuitos em dispositivos l&oacute;gicos reconfigur&aacute;veis.</li>
					<li>Realizar o estudo das ferramentas de design para a s&iacute;ntese e simula&ccedil;&otilde;es de circuitos em l&oacute;gica reconfigur&aacute;vel.</li>
					<li>Desenvolver projetos de circuitos digitais em l&oacute;gica reconfigur&aacute;vel utilizando diagramas de blocos, linguagem de s&iacute;ntese e m&aacute;quinas de estados.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do plano de ensino e introdu&ccedil;&atilde;o a disciplina - 4 aulas;</li>
					<li>Revis&atilde;o dos fundamentos de sistemas digitais - 4 aulas;</li>
					<li>Estudo das ferramentas de simula&ccedil;&atilde;o de sistemas digitais - 4 aulas;</li>
					<li>Fundamentos de l&oacute;gica reconfigur&aacute;vel - 4 aulas;</li>
					<li>Estudo dos dispositivos l&oacute;gicos reconfigur&aacute;veis - 4 aulas;</li>
					<li>Estudo de das formas de s&iacute;ntese dos circuitos - 4 aulas;</li>
					<li>Estudo de ferramentas de EDA e simula&ccedil;&atilde;o - 4 aulas;</li>
					<li>Pr&aacute;ticas com as ferramentas de EDA e simula&ccedil;&atilde;o - 8 aulas;</li>
					<li>Atividade pr&aacute;tica avaliativa 1 (R1) - 4 aulas;</li>
					<li>Estudo de uma linguagem para s&iacute;ntese de circuitos - 4 aulas;</li>
					<li>Pr&aacute;ticas com uma linguagem para s&iacute;ntese de circuitos - 8 aulas;</li>
					<li>Atividade pr&aacute;tica avaliativa 2 (R2) - 4 aulas;</li>
					<li>Desenvolvimento de um projeto com l&oacute;gica reconfigur&aacute;vel - 12 aulas;</li>
					<li>Entrega do projeto com l&oacute;gica reconfigur&aacute;vel (R3) - 4 aulas;</li>
				</ul>

				<h2>Metodologia</h2>

				<p>As aulas ser&atilde;o conduzidas de maneira expositivo-dialogadas, com exerc&iacute;cios pr&aacute;ticos e atividades individuais e em grupo. O principal foco do desenvolvimento do conhecimento ser&aacute; atrav&eacute;s do estudo dos fundamentos te&oacute;ricos e da elabora&ccedil;&atilde;o de projetos pr&aacute;ticos que envolvam os conte&uacute;dos estudados na teoria. O professor ir&aacute; atuar como intermedi&aacute;rio para que o aluno no final da disciplina consiga resolver ativamente problemas do mundo real com o uso dos dispositivos l&oacute;gicos program&aacute;veis. O material did&aacute;tico ser&aacute; disponibilizado de forma a guiar o desenvolvimento das atividades, com complementa&ccedil;&atilde;o atrav&eacute;s de livros e pesquisas na internet. As aulas ser&atilde;o realizadas em laborat&oacute;rio, onde ser&atilde;o disponibilizados os equipamentos e softwares necess&aacute;rios ao desenvolvimento das atividades pr&aacute;ticas.<br/></p>
				
				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>
				
				<p>A nota final ser&aacute; composta de 3 avalia&ccedil;&otilde;es pr&aacute;ticas, na forma de relat&oacute;rios contendo a descri&ccedil;&atilde;o dos experimentos executados bem como os esquemas eletr&ocirc;nicos e os c&oacute;digos empregados. A m&eacute;dia final (Mf) ser&aacute; composta pela m&eacute;dia da nota dos relat&oacute;rios como apresentado na express&atilde;o a seguir:<br />
				<strong>Nf = (R1 + R2 + R3) / 3.</strong><br />
				O aluno &eacute; considerado aprovado se:<br />
				1 &ndash; MF for maior ou igual a 7,0 onde MF &eacute; a m&eacute;dia final anual.<br />
				O aluno que n&atilde;o obtiver rendimento igual ou superior a 7 no ano letivo, ter&aacute; direito a realizar exame. Ser&aacute; considerado aprovado o aluno que obtiver MP = (0,5MF+0,5ME) maior ou igual a 5,0 onde MP &eacute; a m&eacute;dia ap&oacute;s exame e ME &eacute; a nota obtida no exame.

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>PEDRONI, Volnei A. <strong>Eletr&ocirc;nica digital moderna e VHDL.</strong> Elsevier. 2010<br />
				TOCCI, Ronald J; WIDMER, Neal S; MOSS, Gregory L. S.<strong> Sistemas digitais: princ&iacute;pios e aplica&ccedil;&otilde;es. </strong>11. Pearson.2011<br />
				IDOETA, Ivan V; CAPUANO, Francisco Gabriel. <strong>Elementos de eletr&ocirc;nica digital. </strong>40. &Eacute;rica. 2011</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>PEDRONI, Volnei A. <strong>Circuit Design and Simulation with VHDL. </strong>2. MIT Press. 2010<br />
				LOUREN&Ccedil;O, Antonio Carlos de; CRUZ, Eduardo Cesar Alves; CHOUERI JUNIOR, Salomao; FERREIRA, Sabrina Rodero. <strong>Circuitos digitais.</strong> 9. &Eacute;rica. 2007<br />
				GARCIA, Paulo Alves; MARTINI, Jos&eacute; Sidnei Colombo. <strong>Eletr&ocirc;nica digital: teoria e laborat&oacute;rio.</strong> 2. &Eacute;rica. 2008<br />
				TOKHEIM, Roger L. <strong>Fundamentos de eletr&ocirc;nica digital: v.2 sistemas sequenciais.</strong> 7. AMGH. 2013<br />
				DONOVAN, Robert; BIGNELL, James W. <strong>Eletr&ocirc;nica digital. 5.</strong> Cengage Learning. 2010</p>
            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
