<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <div id="menu-placeholder"></div>
			<script>
			  fetch('menu.html')
				.then(response => response.text())
				.then(data => {
				  document.getElementById('menu-placeholder').innerHTML = data;
				})
				.catch(error => console.error('Erro ao carregar o menu:', error));
			</script>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>Projeto Integrador I</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Material Auxiliar</h2>

				<p><a href="Anexos/Slides Introdução Projeto Integrador I.pdf">Slides Introdu&ccedil;&atilde;o Projeto Integrador I</a></p>

				<p><a href="Anexos/Modelo%20de%20Rel.%20Projeto%20Integrador%20v4.docx%20.docx">Modelo de Relat&oacute;rio de Projeto Integrador</a></p>

				<h2>Eixo tecnol&oacute;gico: Controle e Processos industriais</h2>

				<h2>Ementa</h2>

				<p>Fundamentos para trabalhos em equipe, orienta&ccedil;&otilde;es para elabora&ccedil;&atilde;o de cronograma, estudo de viabilidade, lista de materiais e defini&ccedil;&otilde;es de metodologia e procedimentos. Instru&ccedil;&otilde;es para elabora&ccedil;&atilde;o, execu&ccedil;&atilde;o e apresenta&ccedil;&atilde;o de projetos t&eacute;cnicos que integrem os conte&uacute;dos abordados no primeiro, no segundo e no terceiro semestre do curso. Elabora&ccedil;&atilde;o de um projeto acompanhado de relat&oacute;rio final e apresenta&ccedil;&atilde;o, que considere as caracter&iacute;sticas de aplica&ccedil;&otilde;es industriais automatizadas</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>O projeto integrador tem o objetivo de refor&ccedil;ar o aprendizado te&oacute;rico e pr&aacute;tico que o estudante obteve no decorrer do curso atrav&eacute;s da idealiza&ccedil;&atilde;o de um projeto e posterior execu&ccedil;&atilde;o e apresenta&ccedil;&atilde;o do mesmo, que envolva inclusive as componentes curriculares do m&oacute;dulo atual.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Integrar o conte&uacute;do das componentes curriculares do semestre, e semestres passados;</li>
					<li>Capacitar o aluno a desenvolver projetos e solu&ccedil;&otilde;es para problemas.</li>
					<li>Aperfei&ccedil;oar a capacidade do aluno de executar projetos.</li>
					<li>Incentivar o trabalho em grupo.</li>
					<li>Desenvolver habilidades de apresenta&ccedil;&atilde;o em p&uacute;blico.</li>
					<li>Incentivar a busca por inova&ccedil;&otilde;es tecnol&oacute;gicas para o desenvolvimento do projeto.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do plano de ensino, Introdu&ccedil;&atilde;o a elabora&ccedil;&atilde;o de projetos t&eacute;cnicos, Cronograma e estudo de viabilidade; 4 aulas.&nbsp;</li>
					<li>Distribui&ccedil;&atilde;o das equipes, Discuss&atilde;o dos temas dos projetos, Defini&ccedil;&otilde;es de metodologia e procedimentos; 4 aulas.&nbsp;</li>
					<li>Elabora&ccedil;&atilde;o da lista de materiais, Elabora&ccedil;&atilde;o do pr&eacute;-projeto; 12 aulas.&nbsp;</li>
					<li>Entrega do pr&eacute;-projeto (N1) e Apresenta&ccedil;&atilde;o do pr&eacute;-projeto (N2); 4 aulas.&nbsp;</li>
					<li>Execu&ccedil;&atilde;o do projeto; 28 aulas.&nbsp;</li>
					<li>Execu&ccedil;&atilde;o do projeto e Elabora&ccedil;&atilde;o do relat&oacute;rio do projeto; 12 aulas.&nbsp;</li>
					<li>Apresenta&ccedil;&atilde;o do projeto (N3), Entrega do relat&oacute;rio do projeto (N4), Avalia&ccedil;&atilde;o individual da execu&ccedil;&atilde;o do projeto (N5); 4 aulas.&nbsp;</li>
					<li>Recupera&ccedil;&atilde;o de conte&uacute;do e notas; 4 aulas.</li>
				</ul>

				<h2>Metodologia</h2>

				<p>A disciplina ser&aacute; conduzida de forma expositiva, orientando os alunos na proposi&ccedil;&atilde;o e execu&ccedil;&atilde;o dos projetos. Ser&atilde;o feitas abordagens nos grupos de trabalho para sanar eventuais d&uacute;vidas e instigar os alunos a propor solu&ccedil;&otilde;es &agrave;s dificuldades/problemas encontrados com base nos conhecimentos t&eacute;cnicos adquiridos. Ser&atilde;o disponibilizados materiais e equipamentos contidos nos laborat&oacute;rios do curso para a execu&ccedil;&atilde;o dos projetos. Os grupos dever&atilde;o desenvolver documentos com a proposta do projeto, cronograma de trabalho e lista de materiais. Al&eacute;m disso, caber&aacute; a emiss&atilde;o de um relat&oacute;rio final do projeto e sua apresenta&ccedil;&atilde;o oral. Tamb&eacute;m poder&atilde;o ser realizadas visitas t&eacute;cnicas de forma a exemplificar como s&atilde;o implementados os projetos no ambiente de trabalho.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>Procedimentos de Avalia&ccedil;&atilde;o: A nota final ser&aacute; composta de cinco (05) avalia&ccedil;&otilde;es. As primeiras avalia&ccedil;&otilde;es ser&atilde;o feitas sobre o pr&eacute;-projeto (N1) e sua apresenta&ccedil;&atilde;o (N2). Ap&oacute;s a conclus&atilde;o do projeto ser&aacute; avaliada a apresenta&ccedil;&atilde;o do projeto (N3), o relat&oacute;rio do projeto (N4) e a avalia&ccedil;&atilde;o individual da execu&ccedil;&atilde;o do projeto (N5). A m&eacute;dia (M) ser&aacute; composta pela m&eacute;dia de todas as avalia&ccedil;&otilde;es aplicadas ao longo da disciplina conforme a seguir:<br />
				<strong>M = N1 x 0,2 + N2 x 0,2 + N3 x 0,2 + N4 x 0,2 + N5 x 0,2.</strong><br />
				O estudante que n&atilde;o atingir a m&eacute;dia 7,0 ter&aacute; direito a recupera&ccedil;&atilde;o paralela, ou seja, revis&atilde;o dos conte&uacute;dos e reavalia&ccedil;&atilde;o que ser&aacute; realizada na data de 07/06/2023 O estudante que n&atilde;o atingir m&eacute;dia 7,0 tem direito a realiza&ccedil;&atilde;o do exame para que seja feita a reposi&ccedil;&atilde;o das notas, atendido o crit&eacute;rio de aprova&ccedil;&atilde;o por assiduidade, sendo que a m&eacute;dia final para aprova&ccedil;&atilde;o deve ser maior que, ou igual a 5,0 (cinco), resultante da seguinte f&oacute;rmula:<br />
				MF = (MP+ME)/2<br />
				onde<br />
				MF = M&eacute;dia final<br />
				MP = M&eacute;dia do per&iacute;odo</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>BOLTON, William. <strong>Mecatr&ocirc;nica: uma abordagem multidiscilinar.</strong> 4. Bookman. 2010<br />
				PRUDENTE, Francesco. <strong>Automa&ccedil;&atilde;o industrial - PLC: teoria e aplica&ccedil;&otilde;es.</strong> LTC. 2007<br />
				FRANCHI, Claiton Moro. <strong>Acionamentos el&eacute;tricos.</strong> 4. &Eacute;rica. 2008</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>BONACORSO, Nelso Gauze; NOLL, Valdir. <strong>Automa&ccedil;&atilde;o eletropneum&aacute;tica. </strong>11. &Eacute;rica. 2010<br />
				ALCIATORE, David G.; HISTAND, Michael B. <strong>Introdu&ccedil;&atilde;o &agrave; mecatr&ocirc;nica e aos sistemas de medi&ccedil;&otilde;es. </strong>4. AMGH. 2014<br />
				MANZANO, Jos&eacute; Augusto N. G. <strong>Estudo Dirigido de Linguagem C.</strong> 14. &Eacute;rica. 2010<br />
				KOSOW, Irving L. <strong>M&aacute;quinas el&eacute;tricas e transformadores.</strong> 15. Globo. 2005<br />
				CREDER, H&eacute;lio.<strong> Instala&ccedil;&otilde;es el&eacute;tricas. </strong>115. Livros T&eacute;cnicos e Cient&iacute;ficos. 200</p>
            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
