<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
        <meta name="description" content="" />
        <meta name="author" content="" />
        <title>Ricardo Kerschbaumer</title>
        <!-- Favicon-->
        <link rel="icon" type="image/x-icon" href="assets/favicon.ico" />
        <!-- Core theme CSS (includes Bootstrap)-->
        <link href="css/styles.css" rel="stylesheet" />
    </head>
    <body>
        <!-- Responsive navbar-->
        <div id="menu-placeholder"></div>
			<script>
			  fetch('menu.html')
				.then(response => response.text())
				.then(data => {
				  document.getElementById('menu-placeholder').innerHTML = data;
				})
				.catch(error => console.error('Erro ao carregar o menu:', error));
			</script>
        <!-- Page content-->
        <div class="container">
            <div class="text-center mt-5">
                <h1>T&oacute;picos em Intelig&ecirc;ncia Artificial</h1>
                <p class="lead"><div style="text-align: justify">
				<h2>Material Auxiliar</h2>

				<p><a href="Anexos/AlgoritmosEEstruturaDaInformacao.pdf">Apostila de Algoritmos e Estrutura da Informa&ccedil;&atilde;o</a></p>

				<h2>Material das Aulas</h2>

				<p><a href="Anexos/Slides Introdução a TIA.pdf">Slides de Introdu&ccedil;&atilde;o a T&oacute;picos em Intelig&ecirc;ncia Artificial</a></p>

				<p><a href="Anexos/Slides Sistemas Especialistas.pdf">Slides Sistemas Especialistas</a></p>

				<p><a href="Anexos/Slides Lógica Fuzzy.pdf">Slides L&oacute;gica Fuzzy</a></p>

				<ul>
					<li><a href="Anexos/Métodos de defuzzificação.pdf">M&eacute;todos de Defuzzifica&ccedil;&atilde;o</a></li>
					<li><a href="https://replit.com/@RicardoKers/MaquinaDeLavar">Exemplo da m&aacute;quina de lavar roupas</a></li>
					<li><a href="Anexos/Exercício de lógica fuzzy.pdf">Exerc&iacute;cio de l&oacute;gica fuzzy</a></li>
				</ul>

				<p><a href="Anexos/Slides Algoritmos Genéticos.pdf">Slides Algoritmos Gen&eacute;ticos</a></p>

				<ul>
					<li><a href="https://replit.com/@RicardoKers/AGProblemaDaMochilaLimites">Exemplo de Algoritmo Gen&eacute;tico, problema da mochila</a></li>
					<li><a href="Anexos/Exercício de algoritmos genéticos.pdf">Exerc&iacute;cio de algoritmos gen&eacute;ticos</a></li>
				</ul>

				<p><a href="Anexos/Slides Redes Neurais.pdf">Slides Redes Neurais</a></p>

				<ul>
					<li><a href="https://replit.com/@RicardoKers/RNA-treinamento">Exemplo Rede Neural Artificial &ndash; Treinamento</a></li>
					<li><a href="https://replit.com/@RicardoKers/RNA-PortaLogica">Exemplo Rede Neural Artificial - Porta L&oacute;gica</a></li>
					<li><a href="https://replit.com/@RicardoKers/RNA-CircuitoDigital">Exemplo de Rede Neural Artificial - Circuito Digital</a></li>
					<li><a href="Anexos/Exercício de Redes Neurais Artificiais.pdf">Exerc&iacute;cio de Redes Neurais Artificiais</a></li>
				</ul>

				<h2>Outros Materiais</h2>

				<p><a href="Anexos/Dados para o problema do caixeiro vianajte.pdf">Dados para o problema do caixeiro vianajte</a></p>

				<h2>Ementa</h2>

				<p>Sistemas especialistas. L&oacute;gica Fuzzy. Algoritmos gen&eacute;ticos. Redes neurais. Deep Learning.</p>

				<h2>Objetivos</h2>

				<h3>Objetivo Geral</h3>

				<p>Compreender os diferentes paradigmas envolvidos com a Intelig&ecirc;ncia Artificial. Entender suas principais aplica&ccedil;&otilde;es e limita&ccedil;&otilde;es. Aplicar os conceitos e t&eacute;cnicas da Intelig&ecirc;ncia Artificial.</p>

				<h3>Objetivos Espec&iacute;ficos</h3>

				<ul>
					<li>Apresentar os conceitos sobre Intelig&ecirc;ncia Artificial e como eles podem ser aplicados na pr&aacute;tica;</li>
					<li>Apresentar os problemas cl&aacute;ssicos que podem ser resolvidos atrav&eacute;s da Intelig&ecirc;ncia Artificial;</li>
					<li>Capacitar o aluno em identificar qual a solu&ccedil;&atilde;o de Intelig&ecirc;ncia Artificial mais adequada para a resolu&ccedil;&atilde;o de determinado problema;</li>
					<li>Apresentar as principais tend&ecirc;ncias da &aacute;rea de Intelig&ecirc;ncia Artificial.</li>
				</ul>

				<h2>Conte&uacute;do Program&aacute;tico</h2>

				<ul>
					<li>Apresenta&ccedil;&atilde;o do plano de ensino e introdu&ccedil;&atilde;o aos T&oacute;picos em Intelig&ecirc;ncia Artificial 4 aulas;</li>
					<li>Programa&ccedil;&atilde;o de sistemas de intelig&ecirc;ncias artificial 4 aulas;</li>
					<li>Sistemas especialistas e exerc&iacute;cios 4 aulas;</li>
					<li>L&oacute;gica Fuzzy 4 aulas;</li>
					<li>Pr&aacute;tica com L&oacute;gica Fuzzy 4 aulas;</li>
					<li>Pr&aacute;tica com L&oacute;gica Fuzzy (N1) 4 aulas;</li>
					<li>Algoritmos gen&eacute;ticos 4 aulas;</li>
					<li>Pr&aacute;tica com Algoritmos gen&eacute;ticos 4 aulas;</li>
					<li>Pr&aacute;tica com Algoritmos gen&eacute;ticos (N2) 4 aulas;</li>
					<li>Redes Neurais 4 aulas;</li>
					<li>Pr&aacute;tica com Redes Neurais 4 aulas;</li>
					<li>Pr&aacute;tica com Redes Neurais (N3) 4 aulas;</li>
					<li>Defini&ccedil;&atilde;o de um projeto que envolva Intelig&ecirc;ncia artificial 4 aulas;</li>
					<li>Elabora&ccedil;&atilde;o do projeto 4 aulas;</li>
					<li>Elabora&ccedil;&atilde;o do projeto 4 aulas;</li>
					<li>Elabora&ccedil;&atilde;o do projeto 4 aulas;</li>
					<li>Elabora&ccedil;&atilde;o do projeto 4 aulas;</li>
					<li>Apresenta&ccedil;&atilde;o do projeto (N4) 4 aulas;</li>
				</ul>

				<h2>Metodologia</h2>

				<p>As aulas ser&atilde;o conduzidas de maneira expositivo-dialogadas, com exerc&iacute;cios pr&aacute;ticos e atividades individuais e em grupo, O principal foco do desenvolvimento do conhecimento ser&aacute; atrav&eacute;s da resolu&ccedil;&atilde;o de exerc&iacute;cios para cada assunto estudado, atrav&eacute;s da colabora&ccedil;&atilde;o coletiva e no final an&aacute;lise e discuss&atilde;o dos resultados. O professor ir&aacute; atuar como intermedi&aacute;rio para que o aluno no final da disciplina consiga resolver ativamente problemas do mundo real com o uso do computador. O material did&aacute;tico ser&aacute; disponibilizado de forma a guiar o desenvolvimento das aulas, com complementa&ccedil;&atilde;o atrav&eacute;s de livros e pesquisas na internet, al&eacute;m da utiliza&ccedil;&atilde;o de conte&uacute;dos multim&iacute;dia como sites, blogs e v&iacute;deos. As aulas ser&atilde;o realizadas em sala de aula, onde ser&atilde;o abordadas as atividades que envolvem racioc&iacute;nio l&oacute;gico e, quando necess&aacute;rio, no laborat&oacute;rio de inform&aacute;tica para o desenvolvimento de programas computacionais. Tamb&eacute;m, se poss&iacute;vel, pretende-se realizar visitas t&eacute;cnicas de forma a visualizar aplica&ccedil;&otilde;es da intelig&ecirc;ncia artificial na pr&aacute;tica.</p>

				<h2>Procedimentos de Avalia&ccedil;&atilde;o</h2>

				<p>A m&eacute;dia do per&iacute;odo ser&aacute; composta de 4 avalia&ccedil;&otilde;es. As avalia&ccedil;&otilde;es ser&atilde;o feitas sobre a pr&aacute;tica com<br />
				L&oacute;gica Fuzzy (N1), a pr&aacute;tica com Algoritmos gen&eacute;ticos (N2), a pr&aacute;tica com Redes Neurais (N3) e a<br />
				apresenta&ccedil;&atilde;o do projeto (N4). A m&eacute;dia do per&iacute;odo (MP) ser&aacute; composta pela m&eacute;dia de todas as<br />
				avalia&ccedil;&otilde;es aplicadas ao longo da disciplina conforme a seguir:<br />
				<strong>MP = N1 x 0,2 +N2 x 0,2 +N3 x 0,2 + N4 x 0,4.</strong><br />
				O estudante que n&atilde;o atingir m&eacute;dia 7,0 tem direito a realiza&ccedil;&atilde;o do exame para que seja feita a reposi&ccedil;&atilde;o<br />
				das notas, atendido o crit&eacute;rio de aprova&ccedil;&atilde;o por assiduidade, sendo que a m&eacute;dia final para aprova&ccedil;&atilde;o<br />
				deve ser maior que, ou igual a 5,0 (cinco), resultante da seguinte f&oacute;rmula:<br />
				MF = (MP+ME)/2<br />
				onde<br />
				MF = M&eacute;dia final<br />
				MP = m&eacute;dia do per&iacute;odo<br />
				ME = m&eacute;dia do exame</p>

				<h2>Refer&ecirc;ncias Bibliogr&aacute;ficas</h2>

				<h3>Refer&ecirc;ncia bibliografia b&aacute;sica</h3>

				<p>RUSSELL, Stuart Jonathan; NORVING,&nbsp;<strong>Peter. Intelig&ecirc;ncia artificial.</strong>&nbsp;2. ed. 7 reimp. Rio de Janeiro: Elsevier, 2004.<br />
				CAMPOS, Mario Massa de; SAITO, Kaku.&nbsp;<strong>Sistemas inteligentes em controle e automa&ccedil;&atilde;o de processos</strong>. Rio de Janeiro: Ci&ecirc;ncia Moderna Ltda, 2004.<br />
				ROSA, Jo&atilde;o Lu&iacute;s Garcia.&nbsp;<strong>Fundamentos da intelig&ecirc;ncia artificial</strong>. Rio de Janeiro: LTC, 2011.</p>

				<h3>Refer&ecirc;ncia bibliogr&aacute;fica complementar</h3>

				<p>SIM&Otilde;ES, Marcelo Godoy; SHAW, Ian S.&nbsp;<strong>Controle e modelagem fuzzy</strong>. 2. ed. rev. e ampl. S&atilde;o Paulo: Edgard Blucher, 2007.<br />
				NASCIMENTO JR, Cairo L.; YONEYAMA, Takashi.<strong>&nbsp;Intelig&ecirc;ncia artificial em controle e automa&ccedil;&atilde;o</strong>. S&atilde;o Paulo: Edgard Blucher, 2000.<br />
				HAYKIN, Simon.<strong>&nbsp;Redes neurais : princ&iacute;pios e pr&aacute;tica.</strong>&nbsp;2. ed. Porto Alegre: Bookman, 2001.<br />
				CARVALHO, Andr&eacute;.<strong>&nbsp;Intelig&ecirc;ncia artificial: uma abordagem de aprendizagem de m&aacute;quina.&nbsp;</strong>1 ed. LTC. 2011<br />
				LIMA, Isaias; PINHEIRO, Carlos A. M.; SANTOS, Flavia A. Oliveira.&nbsp;<strong>Intelig&ecirc;ncia Artificial.</strong>&nbsp;1 ed. Campus. 2014</p>

            </div>
        </div>
		<!-- Bootstrap core JS-->
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js"></script>
        <!-- Core theme JS-->
        <script src="js/scripts.js"></script>
    </body>
</html>
